socialNetwork/10t_1m_100c_2000r_IS0.log
Running 30s test @ http://localhost:8080/wrk2-api/user/register
  10 threads and 80 connections

  Thread calibration: mean lat.: 0.352ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.361ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.360ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.349ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.365ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.361ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.344ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.344ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   346.91us  130.51us 740.00us   90.35%
    Req/Sec   130.90    118.20   444.00     57.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  323.00us
 75.000%  375.00us
 90.000%  458.00us
 99.000%  740.00us
 99.900%    1.38ms
 99.990%    5.23ms
 99.999%    5.79ms
100.000%    5.79ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.003     0.000000            1         1.00
       0.256     0.100000         2547         1.11
       0.276     0.200000         4989         1.25
       0.293     0.300000         7505         1.43
       0.308     0.400000         9982         1.67
       0.323     0.500000        12495         2.00
       0.331     0.550000        13737         2.22
       0.340     0.600000        15092         2.50
       0.349     0.650000        16296         2.86
       0.360     0.700000        17440         3.33
       0.375     0.750000        18711         4.00
       0.384     0.775000        19360         4.44
       0.394     0.800000        19944         5.00
       0.406     0.825000        20555         5.71
       0.421     0.850000        21182         6.67
       0.438     0.875000        21799         8.00
       0.447     0.887500        22105         8.89
       0.458     0.900000        22407        10.00
       0.473     0.912500        22741        11.43
       0.488     0.925000        23047        13.33
       0.504     0.937500        23341        16.00
       0.514     0.943750        23497        17.78
       0.525     0.950000        23665        20.00
       0.539     0.956250        23811        22.86
       0.554     0.962500        23967        26.67
       0.572     0.968750        24125        32.00
       0.584     0.971875        24200        35.56
       0.601     0.975000        24274        40.00
       0.618     0.978125        24354        45.71
       0.640     0.981250        24430        53.33
       0.663     0.984375        24507        64.00
       0.677     0.985938        24546        71.11
       0.697     0.987500        24587        80.00
       0.717     0.989062        24624        91.43
       0.749     0.990625        24664       106.67
       0.784     0.992188        24702       128.00
       0.806     0.992969        24722       142.22
       0.832     0.993750        24741       160.00
       0.857     0.994531        24760       182.86
       0.882     0.995313        24781       213.33
       0.918     0.996094        24799       256.00
       0.943     0.996484        24809       284.44
       0.983     0.996875        24819       320.00
       1.024     0.997266        24828       365.71
       1.077     0.997656        24838       426.67
       1.161     0.998047        24848       512.00
       1.203     0.998242        24853       568.89
       1.252     0.998437        24858       640.00
       1.267     0.998633        24862       731.43
       1.317     0.998828        24867       853.33
       1.376     0.999023        24872      1024.00
       1.491     0.999121        24875      1137.78
       1.626     0.999219        24877      1280.00
       1.706     0.999316        24879      1462.86
       2.005     0.999414        24882      1706.67
       2.315     0.999512        24884      2048.00
       2.351     0.999561        24886      2275.56
       2.701     0.999609        24887      2560.00
       2.761     0.999658        24888      2925.71
       2.813     0.999707        24889      3413.33
       2.905     0.999756        24890      4096.00
       2.907     0.999780        24891      4551.11
       3.611     0.999805        24892      5120.00
       3.611     0.999829        24892      5851.43
       4.523     0.999854        24893      6826.67
       4.523     0.999878        24893      8192.00
       5.231     0.999890        24894      9102.22
       5.231     0.999902        24894     10240.00
       5.231     0.999915        24894     11702.86
       5.659     0.999927        24895     13653.33
       5.659     0.999939        24895     16384.00
       5.659     0.999945        24895     18204.44
       5.659     0.999951        24895     20480.00
       5.659     0.999957        24895     23405.71
       5.787     0.999963        24896     27306.67
       5.787     1.000000        24896          inf
#[Mean    =        0.347, StdDeviation   =        0.131]
#[Max     =        5.784, Total count    =        24896]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  37302 requests in 30.01s, 7.08MB read
Requests/sec:   1243.07  
Transfer/sec:    241.57KB