socialNetwork/10t_1m_100c_2000r_IS1.log
Running 30s test @ http://localhost:8080/wrk2-api/user/register
  10 threads and 80 connections

  Thread calibration: mean lat.: 4.647ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.611ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.928ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.050ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.759ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.129ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.583ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.534ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 4.551ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.009ms, rate sampling interval: 20ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.43ms   19.06ms  31.10ms   98.19%
    Req/Sec   127.45     86.56   375.00     73.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.42ms
 75.000%    6.56ms
 90.000%   10.33ms
 99.000%   31.10ms
 99.900%   71.87ms
 99.990%  889.34ms
 99.999%    1.04s 
100.000%    1.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.485     0.000000            1         1.00
       0.812     0.100000         2505         1.11
       0.948     0.200000         4981         1.25
       1.257     0.300000         7459         1.43
       2.006     0.400000         9948         1.67
       3.421     0.500000        12434         2.00
       4.235     0.550000        13675         2.22
       4.795     0.600000        14924         2.50
       5.335     0.650000        16161         2.86
       5.883     0.700000        17403         3.33
       6.559     0.750000        18648         4.00
       6.919     0.775000        19270         4.44
       7.339     0.800000        19894         5.00
       7.831     0.825000        20510         5.71
       8.455     0.850000        21135         6.67
       9.231     0.875000        21757         8.00
       9.727     0.887500        22069         8.89
      10.327     0.900000        22376        10.00
      11.055     0.912500        22685        11.43
      11.927     0.925000        22996        13.33
      13.183     0.937500        23308        16.00
      13.951     0.943750        23462        17.78
      14.815     0.950000        23617        20.00
      15.791     0.956250        23773        22.86
      17.087     0.962500        23930        26.67
      18.671     0.968750        24085        32.00
      19.535     0.971875        24162        35.56
      20.879     0.975000        24239        40.00
      22.159     0.978125        24318        45.71
      23.887     0.981250        24394        53.33
      26.015     0.984375        24473        64.00
      27.183     0.985938        24511        71.11
      28.415     0.987500        24550        80.00
      29.999     0.989062        24589        91.43
      31.903     0.990625        24627       106.67
      33.823     0.992188        24666       128.00
      34.719     0.992969        24686       142.22
      35.839     0.993750        24706       160.00
      37.023     0.994531        24725       182.86
      38.271     0.995313        24744       213.33
      40.383     0.996094        24763       256.00
      41.631     0.996484        24773       284.44
      42.559     0.996875        24783       320.00
      44.415     0.997266        24793       365.71
      45.855     0.997656        24802       426.67
      48.447     0.998047        24812       512.00
      50.719     0.998242        24817       568.89
      54.623     0.998437        24822       640.00
      59.647     0.998633        24827       731.43
      66.431     0.998828        24831       853.33
      73.151     0.999023        24836      1024.00
     112.895     0.999121        24839      1137.78
     230.015     0.999219        24841      1280.00
     312.319     0.999316        24844      1462.86
     456.447     0.999414        24846      1706.67
     460.031     0.999512        24848      2048.00
     583.167     0.999561        24850      2275.56
     681.471     0.999609        24851      2560.00
     687.103     0.999658        24853      2925.71
     687.103     0.999707        24853      3413.33
     687.615     0.999756        24854      4096.00
     723.455     0.999780        24855      4551.11
     737.279     0.999805        24856      5120.00
     737.279     0.999829        24856      5851.43
     864.767     0.999854        24857      6826.67
     864.767     0.999878        24857      8192.00
     889.343     0.999890        24858      9102.22
     889.343     0.999902        24858     10240.00
     889.343     0.999915        24858     11702.86
    1034.751     0.999927        24859     13653.33
    1034.751     0.999939        24859     16384.00
    1034.751     0.999945        24859     18204.44
    1034.751     0.999951        24859     20480.00
    1034.751     0.999957        24859     23405.71
    1037.311     0.999963        24860     27306.67
    1037.311     1.000000        24860          inf
#[Mean    =        5.429, StdDeviation   =       19.061]
#[Max     =     1036.800, Total count    =        24860]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  37266 requests in 30.01s, 7.25MB read
  Non-2xx or 3xx responses: 2199
Requests/sec:   1241.68  
Transfer/sec:    247.53KB